; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v10 ?v3)
             (pred_2 ?v6 ?v7)
             (pred_4 ?v10 ?v7)
             (pred_11 ?v4 ?v10 )
	     (pred_10 ?v10)
             (pred_5 ?v13)
             (pred_1 ?v6)
             (pred_3 ?v7)
             (pred_9 ?v10)
             (pred_7 ?v6)
             (pred_8 ?v10)
             (pred_12 ))



(:action op_3
:parameters (?v1 ?v12 ?v5 ?v8)
:precondition (and (pred_5 ?v1) (pred_5 ?v12) (pred_1 ?v5) (pred_3 ?v8)
          (pred_6 ?v1 ?v12) (pred_2 ?v5 ?v8)
                   (pred_4 ?v12 ?v8) (pred_10 ?v1) 
                   (pred_9 ?v12) (pred_7 ?v5))
:effect (and  (pred_8 ?v12) (not (pred_9 ?v12))))


(:action op_1
:parameters (?v1 ?v11)
:precondition (and (pred_5 ?v1) (pred_5 ?v11)
               (pred_10 ?v1) (pred_6 ?v1 ?v11) (pred_8 ?v11))
:effect (and (pred_10 ?v11) (not (pred_10 ?v1))))

(:action op_5
:parameters (?v1 ?v5)
:precondition (and (pred_5 ?v1) (pred_1 ?v5) 
                  (pred_10 ?v1) (pred_11 ?v5 ?v1) (pred_12 ))
:effect (and (pred_7 ?v5)
   (not (pred_11 ?v5 ?v1)) (not (pred_12 ))))


(:action op_4
:parameters (?v1 ?v9 ?v2)
:precondition (and (pred_5 ?v1) (pred_1 ?v9) (pred_1 ?v2)
                  (pred_10 ?v1) (pred_7 ?v2) (pred_11 ?v9 ?v1))
:effect (and (pred_7 ?v9) (pred_11 ?v2 ?v1)
        (not (pred_7 ?v2)) (not (pred_11 ?v9 ?v1))))

(:action op_2
:parameters (?v1 ?v5)
:precondition (and (pred_5 ?v1) (pred_1 ?v5) 
                  (pred_10 ?v1) (pred_7 ?v5))
:effect (and (pred_12 ) (pred_11 ?v5 ?v1) (not (pred_7 ?v5)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_02 obj_04 obj_18 obj_03 obj_09 obj_14 obj_16 obj_07 obj_01 obj_08 obj_19 obj_17 obj_20 obj_13 obj_10 obj_06
    obj_12 obj_05
    obj_11 obj_15
    )

    (:init
       (pred_12)

       (pred_5 obj_02)
       (pred_5 obj_04)
       (pred_5 obj_18)
       (pred_5 obj_03)
       (pred_5 obj_09)
       (pred_5 obj_14)
       (pred_5 obj_16)
       (pred_5 obj_07)
       (pred_5 obj_01)
       (pred_5 obj_08)
       (pred_5 obj_19)
       (pred_5 obj_17)
       (pred_5 obj_20)
       (pred_5 obj_13)
       (pred_5 obj_10)
       (pred_5 obj_06)
       (pred_3 obj_12)
       (pred_3 obj_05)
       (pred_1 obj_11)
       (pred_1 obj_15)

       (pred_6 obj_02 obj_09)
       (pred_6 obj_02 obj_04)
       (pred_6 obj_04 obj_14)
       (pred_6 obj_04 obj_18)
       (pred_6 obj_04 obj_02)
       (pred_6 obj_18 obj_16)
       (pred_6 obj_18 obj_03)
       (pred_6 obj_18 obj_04)
       (pred_6 obj_03 obj_07)
       (pred_6 obj_03 obj_18)
       (pred_6 obj_09 obj_01)
       (pred_6 obj_09 obj_14)
       (pred_6 obj_09 obj_02)
       (pred_6 obj_14 obj_08)
       (pred_6 obj_14 obj_16)
       (pred_6 obj_14 obj_04)
       (pred_6 obj_14 obj_09)
       (pred_6 obj_16 obj_19)
       (pred_6 obj_16 obj_07)
       (pred_6 obj_16 obj_18)
       (pred_6 obj_16 obj_14)
       (pred_6 obj_07 obj_17)
       (pred_6 obj_07 obj_03)
       (pred_6 obj_07 obj_16)
       (pred_6 obj_01 obj_20)
       (pred_6 obj_01 obj_08)
       (pred_6 obj_01 obj_09)
       (pred_6 obj_08 obj_13)
       (pred_6 obj_08 obj_19)
       (pred_6 obj_08 obj_14)
       (pred_6 obj_08 obj_01)
       (pred_6 obj_19 obj_10)
       (pred_6 obj_19 obj_17)
       (pred_6 obj_19 obj_16)
       (pred_6 obj_19 obj_08)
       (pred_6 obj_17 obj_06)
       (pred_6 obj_17 obj_07)
       (pred_6 obj_17 obj_19)
       (pred_6 obj_20 obj_13)
       (pred_6 obj_20 obj_01)
       (pred_6 obj_13 obj_10)
       (pred_6 obj_13 obj_08)
       (pred_6 obj_13 obj_20)
       (pred_6 obj_10 obj_06)
       (pred_6 obj_10 obj_19)
       (pred_6 obj_10 obj_13)
       (pred_6 obj_06 obj_17)
       (pred_6 obj_06 obj_10)
       (pred_9 obj_19)
       (pred_9 obj_18)
       (pred_4  obj_19 obj_12)
       (pred_4  obj_18 obj_05)
       (pred_8 obj_02)
       (pred_8 obj_04)
       (pred_8 obj_03)
       (pred_8 obj_09)
       (pred_8 obj_14)
       (pred_8 obj_16)
       (pred_8 obj_07)
       (pred_8 obj_01)
       (pred_8 obj_08)
       (pred_8 obj_17)
       (pred_8 obj_20)
       (pred_8 obj_13)
       (pred_8 obj_10)
       (pred_8 obj_06)

       (pred_2  obj_11 obj_12)
       (pred_2  obj_15 obj_05)
       (pred_11 obj_11 obj_10)
       (pred_11 obj_15 obj_02)
       (pred_10 obj_01)
    )

    (:goal (and
       (pred_11 obj_11 obj_04)
    ))
(:constraints
  (always (not (pred_10 obj_08)))
)
)

; plan
1. (op_1 obj_01 obj_20)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_20)
   goals met: 0 of 1
2. (op_1 obj_20 obj_13)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_13)
   goals met: 0 of 1
3. (op_1 obj_13 obj_10)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_10)
   goals met: 0 of 1
4. (op_5 obj_10 obj_11)
   deleted: (pred_11 obj_11 obj_10) (pred_12)
   added: (pred_7 obj_11)
   goals met: 0 of 1
5. (op_3 obj_10 obj_19 obj_11 obj_12)
   deleted: (pred_9 obj_19)
   added: (pred_8 obj_19)
   goals met: 0 of 1
6. (op_1 obj_10 obj_19)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_19)
   goals met: 0 of 1
7. (op_1 obj_19 obj_16)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_16)
   goals met: 0 of 1
8. (op_1 obj_16 obj_14)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_14)
   goals met: 0 of 1
9. (op_1 obj_14 obj_04)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_04)
   goals met: 0 of 1
10. (op_2 obj_04 obj_11)
   deleted: (pred_7 obj_11)
   added: (pred_12) (pred_11 obj_11 obj_04)
   goals met: 1 of 1
